{
    "responses": [
        {
            "cards": [
                {
                    "article_url": "https://www.usatoday.com/story/opinion/2019/09/25/nancy-pelosi-donald-trump-impeachment-inquiry-bill-clinton-column/2438656001/",
                    "card_token": "d341bb91-9335-4828-ad8c-bb49ee788296",
                    "description": "Nancy Pelosi waited to launch an impeachment inquiry because she knew Donald Trump would do something to hang himself. He didn't disappoint.\n\nRepublicans accuse House Speaker Nancy Pelosi of making a rush to judgment with her announcement yesterday that she is pulling the trigger on an impeachment inquiry of President Trump.\n\nShe also knew that public opinion wasn't sufficient enough to warrant impeachment proceedings.\n\nBut the allegations against Trump are piling up so fast and are so serious that Pelosi now feels that holding hearings and drilling down into Trump's actions are justified and will boost the case for impeachment.\n\nNewt Gingrich, the Georgia hothead who, as House speaker, spearheaded the impeachment drive against President Bill Clinton in 1998, has been making the TV rounds with his insight on what's going to happen now. As if Clinton's situation then and Trump's now are the same.",
                    "image_url": "https://www.gannett-cdn.com/presto/2019/09/25/USAT/e6b02b53-c53b-488b-aec6-54a0cf7bd4c6-AFP_AFP_SR4W0.JPG?crop=4499,2531,x1,y391&width=3200&height=1680&fit=bounds",
                    "name": "From USAToday.com, Nancy Pelosi's impeachment waiting game paid off. Americans will turn on Donald Trump.",
                    "published_at": "2019-09-25T15:00:23Z",
                    "source": "USAToday.com",
                    "type": "news_item"
                },
                {
                    "article_url": "https://www.mirror.co.uk/3am/celebrity-news/strictly-star-naga-munchetty-reprimanded-20174040",
                    "card_token": "ceb42df4-0f4c-4c36-bedd-edff9c838bf4",
                    "description": "Thank you for subscribingWe have more newslettersShow meSee our privacy notice  The BBC has ruled that BBC Breakfast host and former Strictly Come Dancing star Naga Munchetty breached impartiality rules when she criticised American President Donald Trump.\n\nThe Executive Complaints Unit at the BBC, despite Naga receiving a great deal of praise for speaking up, ruled that her words breached the rules of impartiality that broadcasters are supposed to stick to.\n\nWhen the tweets were sent, Captain America star Chris Evans blasted the President as hateful and racist and casually wielding hate and racism to activate your base.\n\nMr Trump's mos recent celeb clash has come in the form of model and entrepreneur, Chrissy Teigen.\n\nHe felt slighted after not receiving enough credit for signing a criminal justice reform bill, and took aim at Chrissy and her husband, singer John Legend.",
                    "image_url": "https://i2-prod.mirror.co.uk/incoming/article20174314.ece/ALTERNATES/s1200/2_BBC-Breakfast.jpg",
                    "name": "Here's an article from The Mirror. Naga Munchetty reprimanded by BBC for Donald Trump comments",
                    "published_at": "2019-09-25T14:50:30Z",
                    "source": "The Mirror",
                    "type": "news_item"
                },
                {
                    "article_url": "https://www.dailymail.co.uk/news/article-7503615/Donald-Melania-Trump-pose-Ukrainian-President-Volodymyr-Zelensky.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
                    "card_token": "42fd727f-405c-40db-8ee5-b0e839394099",
                    "description": "Donald and Melania Trump pose with Ukrainian President Volodymyr Zelensky at posh diplomatic reception after phone call between two leaders sparks impeachment inquiry.\n\nThe controversy began when a whistle-blower alleged President Trump asked Zelensky to investigate former Vice President Joe Biden and his son Hunter Biden, who sat on the board of a Ukrainian gas company, and their ties to a Ukrainian prosecutor investigating the country.\n\nThe transcript shows Trump mentioned Joe Biden by name and asked the Zelensky to talk to Attorney General William Barr and the president's personal attorney, Rudy Giuliani, about Biden and his son.               'There is a lot of talk about Biden's son, that Biden stopped the prosecution and a lot of people want to find out about that, so whatever you can do with the Attorney General would be great,' Trump says, according to the transcript.\n\nA whistle-blower alleged that in a call with Zelensky in July, Trump pressured him to prosecute former Vice President Joe Biden's son Hunter Biden to hurt Biden's 2020 campaign.",
                    "image_url": "https://i.dailymail.co.uk/1s/2019/09/25/15/18921624-0-image-a-7_1569422506704.jpg",
                    "name": "From Daily Mail UK, Donald and Melania Trump pose with Ukrainian President",
                    "published_at": "2019-09-25T14:43:51Z",
                    "source": "Daily Mail UK",
                    "type": "news_item"
                },
                {
                    "card_token": "cdd821f3-3ae6-4f66-a972-5c47b01a251a",
                    "description": "Former Vice President Joe Biden has joined the deluge of Democrats calling for the initiation of impeachment proceedings against President Donald Trump if he refuses to comply with congressional investigations into his administration..\n\nBiden’s call for Trump’s impeachment makes him the highest-profile Democrat to join the swell of elected officials and presidential candidates—including centrists and so-called “frontline” Democrats, who hold seats in districts Trump won in 2016—supporting an impeachment investigation into the president..\n\nHunter Biden, the former vice president’s son, is a former adviser and member of the board of director for Burisma, a Ukrainian energy company that has been the subject of corruption investigations by that country’s government..\n\nBiden, who has accused Trump of an “overwhelming abuse of power,” had nonetheless been one of the last holdouts among his party’s presidential candidates on the issue of impeachment..\n\nAs frontrunners for the Democratic presidential nomination and, in Biden’s case, the target of the alleged corruption at the center of the scandal, Biden’s and Sanders’ calls add new urgency to the question of a formal impeachment investigation by the House of Representatives..",
                    "name": "Check out this headline from Daily Beast. Biden Calls for Impeachment Investigation of Trump for ‘Abuse of Power’: The Democratic presidential contender now supports impeachment proceedings against Donald Trump—if the president doesn’t turn over key documents.",
                    "published_at": "2019-09-25T14:43:11Z",
                    "source": "Daily Beast",
                    "type": "news_item"
                },
                {
                    "article_url": "https://www.dailymail.co.uk/news/article-7503517/Greta-Thunberg-brushes-Donald-Trumps-sarcastic-attack.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
                    "card_token": "3a17005e-c6fd-4929-a7e4-44fad6eccf5e",
                    "description": "But appearing on a Swedish talk show from New York today, the teenage climate activist said Trump's ridicule 'doesn't make a difference'.\n\nDonald Trump sarcastically mocked Greta Thunberg in a tweet after her impassioned plea for climate action at the UN Climate Summit on Monday.\n\nGreta Thunberg's 'death stare' at Donald Trump as he upstaged her at the UN Climate Summit on Monday has already become a viral meme on social media.\n\nTrump, who has previously claimed that climate change is a Chinese hoax, upstaged Thunberg by walking into the UN Climate Summit on Monday.\n\nGreta Thunberg appeared on Swedish talk show 'Skavlan' with filmmaker Michael Moore and presenter Fredrik Skavlan to discuss her row with Donald Trump  \n  \n    'This is all wrong.",
                    "image_url": "https://i.dailymail.co.uk/1s/2019/09/25/15/18921332-0-image-a-17_1569421325617.jpg",
                    "name": "Daily Mail UK reports, Greta Thunberg brushes off Donald Trump's sarcastic attack",
                    "published_at": "2019-09-25T14:26:39Z",
                    "source": "Daily Mail UK",
                    "type": "news_item"
                },
                {
                    "article_url": "http://feedproxy.google.com/~r/breitbart/~3/4vGUznYD4_k/",
                    "card_token": "f9e68caf-d6ab-42c2-8504-0d0a48fcee4e",
                    "description": "President Donald Trump on Wednesday released the full transcript of his phone call with Ukranian President Volodymyr Zelensky.\n\nI just want to let you know that's the other thing, There's a lot of talk about Biden's son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the Attorney General would be great.\n\nSince we have won the absolute majority in our Parliament; the next prosecutor general will be 100% my person, my candidate, who will be approved, by the parliament and will start as a new prosecutor in September. He or she will look into the situation, specifically to the company that you mentioned in this issue.\n\nI would like to have the Attorney General call you or your people and I would like you to get to the bottom of it.\n\nAs you saw yesterday, that whole nonsense ended with a very poor performance by a man named Robert Mueller, an incompetent performance, but they say a lot of it started with Ukraine.",
                    "image_url": "https://media.breitbart.com/media/2019/09/GettyImages-1164941782-640x335.jpg",
                    "name": "From Breitbart, Read: Donald Trump Releases Transcript with Ukranian President Volodymyr Zelensky",
                    "published_at": "2019-09-25T14:17:08Z",
                    "source": "Breitbart",
                    "type": "news_item"
                },
                {
                    "article_url": "http://news.sky.com/story/donald-trump-urged-ukraine-to-investigate-joe-biden-transcript-shows-11819274",
                    "card_token": "1fa37752-0510-483c-a02f-315a4ed2b78c",
                    "description": "Donald Trump repeatedly urged Ukraine to investigate political rival Joe Biden.\n\nDonald Trump urged Ukraine's leader to work with Rudy Giuliani and the US attorney general to investigate Joe Biden, a memo of the call shows.\n\nIn the call, the US leader raised unsubstantiated allegations that Mr Biden, the former vice president and Democrat candidate in the 2020 election, sought to interfere with a Ukrainian prosecutor's investigation of his son Hunter.\n\nThere's a lot of talk about Biden's son, that Biden stopped the prosecution and a lot of people want to find out about that, Trump said to Ukrainian President Volodymyr Zelenskiy.\n\nThe US president also said there was a lot of talk about Biden's son , lawyer and lobbyist Hunter Biden.",
                    "image_url": "https://e3.365dm.com/19/09/1600x900/skynews-donald-trump-iran_4784664.jpg?20190923223746",
                    "name": "Here's an article from Sky News. Donald Trump urged Ukraine to investigate Joe Biden, transcript shows",
                    "published_at": "2019-09-25T14:12:44Z",
                    "source": "Sky News",
                    "type": "news_item"
                },
                {
                    "article_url": "https://www.dailymail.co.uk/news/article-7503623/Transcript-Donald-Trumps-call-Ukraines-president-published.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
                    "card_token": "a09662df-9f0a-4262-8d39-becec8d227d2",
                    "description": "The White House on Wednesday released the bombshell transcript of President Donald Trump's phone call with the president of Ukraine where Trump urges his counterpart to investigate Joe Biden and work directly with his personal lawyer Rudy Giuliani, and even brings up the DNC's hacked email server.\n\nIn the call, the president mentions political rival Biden by name, seeks an inquiry into a company tied to Biden's surviving son, Hunter, and predicts Ukraine's economy will do 'better and better' - but does not explicitly tie the United States' aid to the country to the investigation he demands.\n\nThere is a lot of talk about Biden's son, that Biden stopped the prosecution and a lot of people want to find out about that, so whatever you can do with the Attorney General would be great,' Trump says, according to the transcript.\n\nThe issue of the investigation of the case is actually the issue of making sure to restore the honesty so we will take care of that and will work on the investigation.'.",
                    "image_url": "https://i.dailymail.co.uk/1s/2019/09/25/15/18890544-0-image-a-4_1569420447535.jpg",
                    "name": "Daily Mail UK reports, BREAKING NEWS: Transcript of Donald Trump's call to Ukraine released",
                    "published_at": "2019-09-25T14:09:24Z",
                    "source": "Daily Mail UK",
                    "type": "news_item"
                },
                {
                    "article_url": "https://www.buzzfeednews.com/article/zoetillman/trump-ukraine-call-transcript-biden-impeachment",
                    "card_token": "0b1fec76-d80b-47de-bd69-2a7961e7d49a",
                    "description": "President Donald Trump asked the president of Ukraine to do him a favor and investigate the origins of the Russia probe as well as former vice president Joe Biden, according to a transcript of the July 25 call.\n\nThe ask, which came during a 30-minute phone call monitored by other White House officials, came immediately after Ukrainian President Volodymyr Zelensky thanked Trump for the United States' defense support and said his country was almost ready to buy more US military technology.\n\nAlthough Trump told Zelensky that he would have Attorney General Bill Barr call the Ukrainian leader, Justice Department spokesperson Kerri Kupec said in a statement that Barr didn't learn about the call until several weeks later, that Trump had never spoken with Barr about investigating Biden or his son, and that Barr has not communicated with Ukrainian officials about Biden or any other subject.\n\nTrump's July 25 call with Zelensky came under scrutiny after news broke earlier this month of an intelligence community whistleblower complaint that reportedly involved Ukraine and a phone call Trump had with a foreign leader where the president made a promise, according to the Washington Post.",
                    "image_url": "https://img.buzzfeed.com/buzzfeed-static/static/2019-09/25/13/asset/79d38d0e39d3/sub-buzz-363-1569419853-1.jpg?crop=2993:1567;0,214",
                    "name": "From BuzzFeed, Five Moments In Donald Trump’s Phone Call To Ukraine That Could Fuel The Impeachment Investigation",
                    "published_at": "2019-09-25T14:04:28Z",
                    "source": "BuzzFeed",
                    "type": "news_item"
                },
                {
                    "article_url": "http://feedproxy.google.com/~r/breitbart/~3/19FTmWM0__M/",
                    "card_token": "b216a2f1-555f-4a09-b9ee-8fa01ee83259",
                    "description": "President Donald Trump reacted Tuesday to Speaker Nancy Pelosi's decision to begin an impeachment inquiry to remove him from office.\n\nThere has been no President in the history of our country who has been treated so badly as I have, he wrote on Twitter.\n\nThe president noted Democrats had gotten nothing done since taking the House majority and electing Rep.\n\nPelosi announced Tuesday she would begin an impeachment inquiry of the president after a whistleblower claimed using secondhand knowledge that the president held an inappropriate call with Ukraine President Volodymyr Zelensky, asking him to investigate former Vice President Joe Biden and his son Hunter Biden for corruption.",
                    "image_url": "https://media.breitbart.com/media/2019/09/GettyImages-1167518196-640x335.jpg",
                    "name": "Here's an article from Breitbart. Donald Trump: Impeachment Democrats 'Frozen with Hatred and Fear'",
                    "published_at": "2019-09-25T12:56:57Z",
                    "source": "Breitbart",
                    "type": "news_item"
                }
            ],
            "html": "<p><span style=\"color: rgb(0, 0, 0);\">Getting you the latest news about donald trump</span></p>",
            "template_name": "news",
            "text": "Getting you the latest news about donald trump\n",
            "trigger": {
                "type": "none"
            }
        }
    ]
}
